GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/hardware/gd32e113v_pinmap.h
/* I2C0 - Remap */

#define GPIO_I2C0_SCL_2          (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFOD|GPIO_CFG_PORT_B|GPIO_CFG_PIN_8)
#define GPIO_I2C0_SDA_2          (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFOD|GPIO_CFG_PORT_B|GPIO_CFG_PIN_9)
#define GPIO_I2C0_SMBA_2         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_5)

/* I2C1 - No remap */

#define GPIO_I2C1_SCL_1          (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFOD|GPIO_CFG_PORT_B|GPIO_CFG_PIN_10)
#define GPIO_I2C1_SDA_1          (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFOD|GPIO_CFG_PORT_B|GPIO_CFG_PIN_11)
#define GPIO_I2C1_SMBA_1         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_12)

/* SPI - Serial Peripheral Interface */

/* SPI0 - No remap */

#define GPIO_SPI0_MISO_1         (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_6)
#define GPIO_SPI0_MOSI_1         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_7)
#define GPIO_SPI0_NSS_1          (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_4)
#define GPIO_SPI0_SCK_1          (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_5)

/* SPI0 - Remap */

#define GPIO_SPI0_MISO_2         (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_4)
#define GPIO_SPI0_MOSI_2         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_5)
#define GPIO_SPI0_NSS_2          (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_15)
#define GPIO_SPI0_SCK_2          (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_3)

/* SPI1 - No remap */

#define GPIO_SPI1_MISO_1         (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_14)
#define GPIO_SPI1_MOSI_1         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_15)
#define GPIO_SPI1_NSS_1          (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_12)
#define GPIO_SPI1_SCK_1          (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_13)

/* SPI2 - No remap */

#define GPIO_SPI2_MISO_1         (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_4)
#define GPIO_SPI2_MOSI_1         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_5)
#define GPIO_SPI2_NSS_1          (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_15)
#define GPIO_SPI2_SCK_1          (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_3)

/* SPI2 - Remap */

#define GPIO_SPI2_MISO_2         (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_C|GPIO_CFG_PIN_11)
#define GPIO_SPI2_MOSI_2         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_C|GPIO_CFG_PIN_12)
#define GPIO_SPI2_NSS_2          (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_4)
#define GPIO_SPI2_SCK_2          (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_C|GPIO_CFG_PIN_10)

/* TIMER - Timers */

/* TIMER0 - No remap (AFIO_PCF0 TIMER0_REMAP = 00) */

#define GPIO_TIMER0_CH0IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_8)
#define GPIO_TIMER0_CH0OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_8)
#define GPIO_TIMER0_CH0OUTN_1    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_13)
#define GPIO_TIMER0_CH1IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_9)
#define GPIO_TIMER0_CH1OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_9)
#define GPIO_TIMER0_CH1OUTN_1    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_14)
#define GPIO_TIMER0_CH2IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_10)
#define GPIO_TIMER0_CH2OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_10)
#define GPIO_TIMER0_CH2OUTN_1    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_15)
#define GPIO_TIMER0_CH3IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_11)
#define GPIO_TIMER0_CH3OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_11)
#define GPIO_TIMER0_ETI_1        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_12)
#define GPIO_TIMER0_BRKIN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_12)

/* TIMER0 - Partial remap (AFIO_PCF0 TIMER0_REMAP = 01) */

#define GPIO_TIMER0_CH0IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_8)
#define GPIO_TIMER0_CH0OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_8)
#define GPIO_TIMER0_CH0OUTN_2    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_7)
#define GPIO_TIMER0_CH1IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_9)
#define GPIO_TIMER0_CH1OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_9)
#define GPIO_TIMER0_CH1OUTN_2    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_0)
#define GPIO_TIMER0_CH2IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_10)
#define GPIO_TIMER0_CH2OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_10)
#define GPIO_TIMER0_CH2OUTN_2    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_1)
#define GPIO_TIMER0_CH3IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_11)
#define GPIO_TIMER0_CH3OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_11)
#define GPIO_TIMER0_ETI_2        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_12)
#define GPIO_TIMER0_BRKIN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_6)

/* TIMER0 - Full remap (AFIO_PCF0 TIMER0_REMAP = 11) */

#define GPIO_TIMER0_CH0IN_3      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_E|GPIO_CFG_PIN_9)
#define GPIO_TIMER0_CH0OUT_3     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_E|GPIO_CFG_PIN_9)
#define GPIO_TIMER0_CH0OUTN_3    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_E|GPIO_CFG_PIN_8)
#define GPIO_TIMER0_CH1IN_3      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_E|GPIO_CFG_PIN_11)
#define GPIO_TIMER0_CH1OUT_3     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_E|GPIO_CFG_PIN_11)
#define GPIO_TIMER0_CH1OUTN_3    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_E|GPIO_CFG_PIN_10)
#define GPIO_TIMER0_CH2IN_3      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_E|GPIO_CFG_PIN_13)
#define GPIO_TIMER0_CH2OUT_3     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_E|GPIO_CFG_PIN_13)
#define GPIO_TIMER0_CH2OUTN_3    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_E|GPIO_CFG_PIN_12)
#define GPIO_TIMER0_CH3IN_3      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_E|GPIO_CFG_PIN_14)
#define GPIO_TIMER0_CH3OUT_3     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_E|GPIO_CFG_PIN_14)
#define GPIO_TIMER0_ETI_3        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_E|GPIO_CFG_PIN_7)
#define GPIO_TIMER0_BRKIN_3      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_E|GPIO_CFG_PIN_15)

/* TIMER1 - No remap (AFIO_PCF0 TIMER1_REMAP = 00) */

#define GPIO_TIMER1_CH0IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_TIMER1_CH0OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_TIMER1_CH1IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_1)
#define GPIO_TIMER1_CH1OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_1)
#define GPIO_TIMER1_CH2IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_TIMER1_CH2OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_TIMER1_CH3IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)
#define GPIO_TIMER1_CH3OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)
#define GPIO_TIMER1_ETI_1        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)

