GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/hardware/gd32e113v_pinmap.h
/* TIMER1 - Partial remap 1 (AFIO_PCF0 TIMER1_REMAP = 01) */

#define GPIO_TIMER1_CH0IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_15)
#define GPIO_TIMER1_CH0OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_15)
#define GPIO_TIMER1_CH1IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_3)
#define GPIO_TIMER1_CH1OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_3)
#define GPIO_TIMER1_CH2IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_TIMER1_CH2OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_TIMER1_CH3IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)
#define GPIO_TIMER1_CH3OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)
#define GPIO_TIMER1_ETI_2        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_15)

/* TIMER1 - Partial remap 2 (AFIO_PCF0 TIMER1_REMAP = 10) */

#define GPIO_TIMER1_CH0IN_3      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_TIMER1_CH0OUT_3     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_TIMER1_CH1IN_3      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_1)
#define GPIO_TIMER1_CH1OUT_3     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_1)
#define GPIO_TIMER1_CH2IN_3      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_10)
#define GPIO_TIMER1_CH2OUT_3     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_10)
#define GPIO_TIMER1_CH3IN_3      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_11)
#define GPIO_TIMER1_CH3OUT_3     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_11)
#define GPIO_TIMER1_ETI_3        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)

/* TIMER1 - Full remap (AFIO_PCF0 TIMER1_REMAP = 11) */

#define GPIO_TIMER1_CH0IN_4      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_15)
#define GPIO_TIMER1_CH0OUT_4     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_15)
#define GPIO_TIMER1_CH1IN_4      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_3)
#define GPIO_TIMER1_CH1OUT_4     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_3)
#define GPIO_TIMER1_CH2IN_4      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_10)
#define GPIO_TIMER1_CH2OUT_4     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_10)
#define GPIO_TIMER1_CH3IN_4      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_11)
#define GPIO_TIMER1_CH3OUT_4     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_11)
#define GPIO_TIMER1_ETI_4        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_15)

/* TIMER2 - No remap (AFIO_PCF0 TIMER2_REMAP = 00) */

#define GPIO_TIMER2_CH0IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_6)
#define GPIO_TIMER2_CH0OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_6)
#define GPIO_TIMER2_CH1IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_7)
#define GPIO_TIMER2_CH1OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_7)
#define GPIO_TIMER2_CH2IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_0)
#define GPIO_TIMER2_CH2OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_0)
#define GPIO_TIMER2_CH3IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_1)
#define GPIO_TIMER2_CH3OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_1)
#define GPIO_TIMER2_ETI_1        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_D|GPIO_CFG_PIN_2)

/* TIMER2 - Partial remap (AFIO_PCF0 TIMER2_REMAP = 10) */

#define GPIO_TIMER2_CH0IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_4)
#define GPIO_TIMER2_CH0OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_4)
#define GPIO_TIMER2_CH1IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_5)
#define GPIO_TIMER2_CH1OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_5)
#define GPIO_TIMER2_CH2IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_0)
#define GPIO_TIMER2_CH2OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_0)
#define GPIO_TIMER2_CH3IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_1)
#define GPIO_TIMER2_CH3OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_1)
#define GPIO_TIMER2_ETI_2        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_D|GPIO_CFG_PIN_2)

/* TIMER2 - Full remap (AFIO_PCF0 TIMER2_REMAP = 11) */

#define GPIO_TIMER2_CH0IN_3      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_C|GPIO_CFG_PIN_6)
#define GPIO_TIMER2_CH0OUT_3     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_C|GPIO_CFG_PIN_6)
#define GPIO_TIMER2_CH1IN_3      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_C|GPIO_CFG_PIN_7)
#define GPIO_TIMER2_CH1OUT_3     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_C|GPIO_CFG_PIN_7)
#define GPIO_TIMER2_CH2IN_3      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_C|GPIO_CFG_PIN_8)
#define GPIO_TIMER2_CH2OUT_3     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_C|GPIO_CFG_PIN_8)
#define GPIO_TIMER2_CH3IN_3      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_C|GPIO_CFG_PIN_9)
#define GPIO_TIMER2_CH3OUT_3     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_C|GPIO_CFG_PIN_9)
#define GPIO_TIMER2_ETI_3        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_D|GPIO_CFG_PIN_2)

/* TIMER3 - No remap (AFIO_PCF0 TIMER3_REMAP = 0) */

#define GPIO_TIMER3_CH0IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_6)
#define GPIO_TIMER3_CH0OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_6)
#define GPIO_TIMER3_CH1IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_7)
#define GPIO_TIMER3_CH1OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_7)
#define GPIO_TIMER3_CH2IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_8)
#define GPIO_TIMER3_CH2OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_8)
#define GPIO_TIMER3_CH3IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_9)
#define GPIO_TIMER3_CH3OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_9)
#define GPIO_TIMER3_ETI_1        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_E|GPIO_CFG_PIN_0)

/* TIMER3 - Remap (AFIO_PCF0 TIMER3_REMAP = 1) */

