GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/hardware/gd32e113v_pinmap.h
#define GPIO_TIMER3_CH0IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_D|GPIO_CFG_PIN_12)
#define GPIO_TIMER3_CH0OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_D|GPIO_CFG_PIN_12)
#define GPIO_TIMER3_CH1IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_D|GPIO_CFG_PIN_13)
#define GPIO_TIMER3_CH1OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_D|GPIO_CFG_PIN_13)
#define GPIO_TIMER3_CH2IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_D|GPIO_CFG_PIN_14)
#define GPIO_TIMER3_CH2OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_D|GPIO_CFG_PIN_14)
#define GPIO_TIMER3_CH3IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_D|GPIO_CFG_PIN_15)
#define GPIO_TIMER3_CH3OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_D|GPIO_CFG_PIN_15)
#define GPIO_TIMER3_ETI_2        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_E|GPIO_CFG_PIN_0)

/* TIMER4 - No remap */

#define GPIO_TIMER4_CH0IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_TIMER4_CH0OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_TIMER4_CH1IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_1)
#define GPIO_TIMER4_CH1OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_1)
#define GPIO_TIMER4_CH2IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_TIMER4_CH2OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_TIMER4_CH3IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)
#define GPIO_TIMER4_CH3OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)

/* TIMER5 - Basic timer (no I/O pins, time-base and DAC trigger only) */

/* TIMER6 - Basic timer (no I/O pins, time-base and DAC trigger only) */

/* TIMER7 - No remap */

#define GPIO_TIMER7_CH0IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_C|GPIO_CFG_PIN_6)
#define GPIO_TIMER7_CH0OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_C|GPIO_CFG_PIN_6)
#define GPIO_TIMER7_CH0OUTN_1    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_7)
#define GPIO_TIMER7_CH1IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_C|GPIO_CFG_PIN_7)
#define GPIO_TIMER7_CH1OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_C|GPIO_CFG_PIN_7)
#define GPIO_TIMER7_CH1OUTN_1    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_0)
#define GPIO_TIMER7_CH2IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_C|GPIO_CFG_PIN_8)
#define GPIO_TIMER7_CH2OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_C|GPIO_CFG_PIN_8)
#define GPIO_TIMER7_CH2OUTN_1    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_1)
#define GPIO_TIMER7_CH3IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_C|GPIO_CFG_PIN_9)
#define GPIO_TIMER7_CH3OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_C|GPIO_CFG_PIN_9)
#define GPIO_TIMER7_ETI_1        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_TIMER7_BRKIN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_6)

/* TIMER8 - No remap (AFIO_PCF1 TIMER8_REMAP = 0) */

#define GPIO_TIMER8_CH0IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_TIMER8_CH0OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_TIMER8_CH1IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)
#define GPIO_TIMER8_CH1OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)

/* TIMER8 - Remap (AFIO_PCF1 TIMER8_REMAP = 1) */

#define GPIO_TIMER8_CH0IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_E|GPIO_CFG_PIN_5)
#define GPIO_TIMER8_CH0OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_E|GPIO_CFG_PIN_5)
#define GPIO_TIMER8_CH1IN_2      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_E|GPIO_CFG_PIN_6)
#define GPIO_TIMER8_CH1OUT_2     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_E|GPIO_CFG_PIN_6)

/* TIMER9 - No remap */

#define GPIO_TIMER9_CH0IN_1      (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_8)
#define GPIO_TIMER9_CH0OUT_1     (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_8)

/* TIMER10 - No remap */

#define GPIO_TIMER10_CH0IN_1     (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_9)
#define GPIO_TIMER10_CH0OUT_1    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_9)

/* TIMER11 - No remap */

#define GPIO_TIMER11_CH0IN_1     (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_14)
#define GPIO_TIMER11_CH0OUT_1    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_14)
#define GPIO_TIMER11_CH1IN_1     (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_15)
#define GPIO_TIMER11_CH1OUT_1    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_15)

/* TIMER12 - No remap */

#define GPIO_TIMER12_CH0IN_1     (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_6)
#define GPIO_TIMER12_CH0OUT_1    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_6)

/* TIMER13 - No remap */

#define GPIO_TIMER13_CH0IN_1     (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_7)
#define GPIO_TIMER13_CH0OUT_1    (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_7)

/* USART/UART - Universal Synchronous/Asynchronous Receiver Transmitter */

/* USART0 - No remap */

#define GPIO_USART0_TX_1         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_9)
#define GPIO_USART0_RX_1         (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_10)
#define GPIO_USART0_CK           (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_8)
#define GPIO_USART0_CTS          (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_11)
#define GPIO_USART0_RTS          (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_12)

/* USART0 - Remap */

#define GPIO_USART0_TX_2         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_6)
#define GPIO_USART0_RX_2         (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_7)

/* USART1 - No remap */

#define GPIO_USART1_TX_1         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_USART1_RX_1         (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)
#define GPIO_USART1_CK_1         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_4)
#define GPIO_USART1_CTS_1        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_USART1_RTS_1        (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_A|GPIO_CFG_PIN_1)

