GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/hardware/gd32e113v_pinmap.h
/* USART1 - Remap */

#define GPIO_USART1_TX_2         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_D|GPIO_CFG_PIN_5)
#define GPIO_USART1_RX_2         (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_D|GPIO_CFG_PIN_6)
#define GPIO_USART1_CK_2         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_D|GPIO_CFG_PIN_7)
#define GPIO_USART1_CTS_2        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_D|GPIO_CFG_PIN_3)
#define GPIO_USART1_RTS_2        (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_D|GPIO_CFG_PIN_4)

/* USART2 - No remap */

#define GPIO_USART2_TX_1         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_10)
#define GPIO_USART2_RX_1         (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_11)
#define GPIO_USART2_CK_1         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_12)
#define GPIO_USART2_CTS_1        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_13)
#define GPIO_USART2_RTS_1        (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_14)

/* USART2 - Partial remap */

#define GPIO_USART2_TX_2         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_C|GPIO_CFG_PIN_10)
#define GPIO_USART2_RX_2         (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_C|GPIO_CFG_PIN_11)
#define GPIO_USART2_CK_2         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_C|GPIO_CFG_PIN_12)
#define GPIO_USART2_CTS_2        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_B|GPIO_CFG_PIN_13)
#define GPIO_USART2_RTS_2        (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_B|GPIO_CFG_PIN_14)

/* USART2 - Full remap */

#define GPIO_USART2_TX_3         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_D|GPIO_CFG_PIN_8)
#define GPIO_USART2_RX_3         (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_D|GPIO_CFG_PIN_9)
#define GPIO_USART2_CK_3         (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_D|GPIO_CFG_PIN_10)
#define GPIO_USART2_CTS_3        (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_D|GPIO_CFG_PIN_11)
#define GPIO_USART2_RTS_3        (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_D|GPIO_CFG_PIN_12)

/* UART3 - No remap */

#define GPIO_UART3_TX_1          (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_C|GPIO_CFG_PIN_10)
#define GPIO_UART3_RX_1          (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_C|GPIO_CFG_PIN_11)

/* UART4 - No remap */

#define GPIO_UART4_TX_1          (GPIO_CFG_OUTPUT|GPIO_CFG_CTL_AFPP|GPIO_CFG_PORT_C|GPIO_CFG_PIN_12)
#define GPIO_UART4_RX_1          (GPIO_CFG_INPUT|GPIO_CFG_CTL_INFLOAT|GPIO_CFG_PORT_D|GPIO_CFG_PIN_2)

#endif /* __ARCH_ARM_SRC_GD32E11X_HARDWARE_GD32E113V_PINMAP_H */

